LabRat3K/PIC16F1-USB-Bootloader/HID/main.c
/*
 * File:   Main.c
 * Author: Szymon Roslowski
 *
 * Created on 13 October 2014, 17:41
 */

#include "usb.h"
#include <pic16f1455.h>

#ifdef WORKAROUND
// CONFIG1
#pragma config FOSC = INTOSC    // Oscillator Selection Bits (INTOSC oscillator: I/O function on CLKIN pin)
#pragma config WDTE = OFF       // Watchdog Timer Enable (WDT disabled)
#pragma config PWRTE = OFF      // Power-up Timer Enable (PWRT disabled)
#pragma config MCLRE = OFF      // MCLR Pin Function Select (MCLR/VPP pin function is Digital Input)
#pragma config CP = OFF         // Flash Program Memory Code Protection (Program memory code protection is disabled)
#pragma config BOREN = ON       // Brown-out Reset Enable (Brown-out Reset enabled)
#pragma config CLKOUTEN = OFF   // Clock Out Enable (CLKOUT function is disabled. I/O or oscillator function on the CLKOUT pin)
#pragma config IESO = OFF       // Internal/External Switchover Mode (Internal/External Switchover Mode is enabled)
#pragma config FCMEN = OFF      // Fail-Safe Clock Monitor Enable (Fail-Safe Clock Monitor is enabled)

// CONFIG2
#pragma config WRT = OFF        // Flash Memory Self-Write Protection (Write protection off)
#pragma config CPUDIV = NOCLKDIV // CPU System Clock Selection Bit (CPU system clock divided by 6)
#pragma config USBLSCLK = 48MHz // USB Low SPeed Clock Selection bit (System clock expects 48 MHz, FS/LS USB CLKENs divide-by is set to 8.)
#pragma config PLLMULT = 3x     // PLL Multipler Selection Bit (3x Output Frequency Selected)
#pragma config PLLEN = ENABLED  // PLL Enable Bit (3x or 4x PLL Enabled)
#pragma config STVREN = ON      // Stack Overflow/Underflow Reset Enable (Stack Overflow or Underflow will cause a Reset)
#pragma config BORV = LO        // Brown-out Reset Voltage Selection (Brown-out Reset Voltage (Vbor), low trip point selected.)
#pragma config LPBOR = OFF      // Low-Power Brown Out Reset (Low-Power BOR is disabled)
#pragma config LVP = OFF         // Low-Voltage Programming Enable (Low-voltage programming enabled)
#endif

// Local Defines
#define LED_OFF  1
#define LED_ON   0

#define Button              PORTAbits.RA3
#define LED_PWR             LATAbits.LATA4
#define LED_USB             LATCbits.LATC3
#define LED_DMX             LATCbits.LATC2

#define KeyToPress          0x04 // Letter A - Lookup Hid Keyboard Scan Codes For further Information

// Local Variables
uint8_t ButtonStatus;  // This is to hold last status of the button so that we only report if it changes
#define APP_CONFIG(selfpwr, milliamps)  __code unsigned char app_config = ((selfpwr)!=0)|(((milliamps)/4)<<1)

APP_CONFIG(0 /*USB_BUS_POWERED*/, 20 );
// Interrupt
//void ISRCode() __interrupt (0)
void app_interrupt( void )
{
    if (UsbInterrupt) {
       ProcessUSBTransactions();
    }
}

static void InitializeSystem(void)
{
    TRISC =         0b00000000;     // Set RC3&RC2 as output 
    TRISA =         0b00001000;     // Button A3 as input
    LATC =          0b00001100;     // Clear Port C Latches; LED's OFF..
    LATA =          0b00010000;     // Clear Port A Latches; LED's OFF..

    ANSELA =        0x00;
    ANSELC =        0x00;
    OSCTUNE =       0x00;
    OSCCON =        0xFC;           // 16MHz HFINTOSC with 3x PLL enabled (48MHz operation)
    ACTCON =        0x90;           // Enable active clock tuning with USB
    OPTION_REG =    0xC3;           // Set prescaler to 256

    ButtonStatus = 0;
}

static void EnableInterrupts(void)
{
    UIE = 0x4B;             // Transaction complete, Start Of Frame, Error, Reset
    INTCONbits.PEIE = 1;    // Peripheral Interrupt enable
    INTCONbits.GIE = 1;     // Global Interrupt Enable
    PIE2bits.USBIE = 1;     // Enable Usb Global Interrupt
}

//Modifier Keys (First Byte in Keyboard Message) - Not used anywere, just plaed here for referene
#define KEY_L_CTRL			0x01
#define KEY_L_SHIFT			0x02
#define KEY_L_ALT			0x04
#define KEY_L_WIN			0x08
#define KEY_R_CTRL			0x10
#define KEY_R_SHIFT			0x20
#define KEY_R_ALT			0x40
#define KEY_R_WIN			0x80

void PrepareTxBuffer(void)
{
    uint8_t i;

    HIDTxBuffer[0] = 0x00;                          // Modifier Key Bits (we are not using any)
    HIDTxBuffer[1] = 0x00;                          // Seond Byte always 0 (Padding Byte)
    HIDTxBuffer[2] = Button ? KeyToPress : 0x00;    // First of possible 6 simultaneous key pressed

    // Fill The Rest Of Buffer with 0
    for(i = 3 ; i < HidReportByteCount; i++)
    {
        HIDTxBuffer[i] = 0x00;
    }
}

void ProcessIncommingData(void)
{
    // Windows Will send only a single Byte
    // with statuses of leds
    // first bit for num lock, second for caps etc..
   // LED_PWR = (HIDRxBuffer[0] & 0x01);
}

static void CheckUsb(void)
{
    if(IsUsbDataAvaialble(HidInterfaceNumber) > 0 )
    {
        ProcessIncommingData();
        ReArmInterface(HidInterfaceNumber);
    }
}

void ProcessIO(void)
{
    // Check USB for incomming Commands
    if (IsUsbReady) CheckUsb();

/*
    // Check Status Of the Button
    if (Button == ButtonStatus ) return;

    // If Button Status Changed - Report
    PrepareTxBuffer();
    HIDSend(HidInterfaceNumber);

    // Save New Button Status
    ButtonStatus = Button;
*/
}

/*
inline void DEBUG_STEP(uint8_t check) {
      LED_DMX = ~(DeviceState & 0x01);
      LED_USB = ~(DeviceState>>1 & 0x01);
//      LED_PWR = ~(DeviceState& 0x04);
     if (check) {
      while(Button==1); // WHile HIgh.. spin..
      while(Button==0); // While LOW .. spin
     }
} */

int app_main(void)
{
      LED_DMX =LED_OFF;
      LED_USB =LED_OFF;
      LED_PWR =LED_OFF;

    InitializeSystem();
    InitializeUSB();
    EnableUSBModule();
    EnableInterrupts(); 

    while(1) { 
      ProcessIO(); 
      if (Button==0) {
         LED_PWR = LED_ON;
         __asm
           reset
         __endasm;
      }
    }
}
